#
# Taps
tap "anomalyco/tap"
tap "beeftornado/rmtree"
tap "denisidoro/tools"
tap "oven-sh/bun"
tap "remotemobprogramming/brew"
#
# brew formulae
#
brew "anomalyco/tap/opencode"
brew "awscli-local"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "btop"
brew "oven-sh/bun/bun"
brew "coreutils"
brew "direnv"
brew "docpars"
brew "dos2unix"
brew "emacs"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gum"
brew "hstr"
brew "httpie"
brew "ispell"
brew "jc"
brew "jq"
brew "localstack"
brew "mob"
brew "nvm"
brew "openssh"
brew "pre-commit"
brew "pstree"
brew "shellcheck"
brew "tig"
brew "tree"
brew "watch"
brew "wget"
brew "yank"
brew "ykman"           # Yubikey manager
brew "yq"
brew "yubico-piv-tool" # Yubikey PIV module
#
# Cask
#
cask "1password-cli"
cask "bitwarden"
cask "claude-code"
cask "gpg-suite"
cask "hiddenbar"
cask "rectangle"
cask "vlc"
cask "swiftbar"
cask "zoom"
