#
# Taps
tap "anomalyco/tap", trusted: true
tap "denisidoro/tools", trusted: true
tap "oven-sh/bun", trusted: true
tap "remotemobprogramming/brew", trusted: true
#
# brew formulae
#
brew "opencode", trusted: true
brew "bash"
brew "bash-completion"
brew "bat"
brew "btop"
brew "bun", trusted: true
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "docker"
brew "docpars", trusted: true
brew "dos2unix"
brew "emacs"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gum"
brew "hstr"
brew "httpie"
brew "ispell"
brew "jc"
brew "jq"
brew "mob", trusted: true
brew "nono"
brew "nvm"
brew "openssh"
brew "pre-commit"
brew "prek"
brew "pstree"
brew "rtk"
brew "shellcheck"
brew "starship"
brew "tree"
brew "watch"
brew "wget"
brew "yank"
brew "ykman"           # Yubikey manager
brew "yq"
brew "yubico-piv-tool" # Yubikey PIV module
#
# Cask
#
cask "1password-cli"
cask "bitwarden"
cask "claude-code"
cask "gpg-suite"
cask "hiddenbar"
cask "rectangle"
cask "vlc"
cask "swiftbar"
cask "zed"
cask "zoom"
