#
# Taps
#
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "pivotal/tap"
tap "versent/taps"
#
# brew formulae
#
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "cairo"
brew "coreutils"
brew "ctop"
brew "dos2unix"
brew "fontconfig"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "gd"
brew "gdbm"
brew "gettext"
brew "git"
brew "git-gui"
brew "glib"
brew "gobject-introspection"
brew "graphite2"
brew "graphviz"
brew "gts"
brew "harfbuzz"
brew "hstr"
brew "htop"
brew "httpie"
brew "icu4c"
brew "ispell"
brew "jasper"
brew "jpeg"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "libevent"
brew "libffi"
brew "libidn2"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "libzip"
brew "lzo"
brew "maven"
brew "ncurses"
brew "netpbm"
brew "node"
brew "oniguruma"
brew "openjdk"
brew "openssl@1.1"
brew "pango"
brew "pcre"
brew "pcre2"
brew "pixman"
brew "pkg-config"
brew "postgresql"
brew "pstree"
brew "python@3.8"
brew "python@3.9"
brew "readline"
brew "saml2aws"
brew "springboot"
brew "sqlite"
brew "stern"
brew "tcl-tk"
brew "tldr"
brew "tmux"
brew "utf8proc"
brew "watch"
brew "webp"
brew "wget"
brew "xz"
brew "z"
brew "zsh"
brew "zsh-completions"
#
# Cask
#
cask "dbeaver-community"
cask "emacs"
cask "kafka-tool"
cask "meld"
cask "pdftotext"
#
#
#mas "Amphetamine", id: 937984704
#mas "Dato", id: 1470584107
#mas "Disk Speed Test", id: 425264550
#mas "GarageBand", id: 682658836
#mas "iMovie", id: 408981434
#mas "Keynote", id: 409183694
#mas "Monosnap", id: 540348655
